Tekla.Structures.Analysis.AnalysisPartPositionProperties.AxisLocationEnum
The axis location.

Tekla.Structures.Analysis.AnalysisPartPositionProperties.AxisLocationEnum.REFERENCE_AXIS_WITH_ECCENTRICITY
The axis location is the reference axis with eccentricity.

Tekla.Structures.Analysis.AnalysisPartPositionProperties.AxisLocationEnum.REFERENCE_AXIS
The axis location is the reference axis.

Tekla.Structures.Analysis.AnalysisPartPositionProperties.AxisLocationEnum.NEUTRAL_AXIS
The axis location is the neutral axis.

Tekla.Structures.Analysis.AnalysisPartPositionProperties.AxisLocationEnum.TOP_PLANE
The axis location is the top plane.

Tekla.Structures.Analysis.AnalysisPartPositionProperties.AxisLocationEnum.MIDDLE_PLANE
The axis location is the middle plane.

Tekla.Structures.Analysis.AnalysisPartPositionProperties.AxisLocationEnum.BOTTOM_PLANE
The axis location is the bottom plane.

Tekla.Structures.Analysis.AnalysisPartPositionProperties.AxisLocationEnum.LEFT_PLANE
The axis location is the left plane.

Tekla.Structures.Analysis.AnalysisPartPositionProperties.AxisLocationEnum.RIGHT_PLANE
The axis location is the right plane.

Tekla.Structures.Analysis.AnalysisPartPositionProperties.AxisLocationEnum.MIDDLE_PLANE_BY_LEFT_RIGHT
The axis location is the middle plane by the left point.

Tekla.Structures.Analysis.AnalysisPartPositionProperties.AxisLocationEnum.TOP_LEFT
The axis location is at the top left corner.

Tekla.Structures.Analysis.AnalysisPartPositionProperties.AxisLocationEnum.TOP_CENTER
The axis location is at top center.

Tekla.Structures.Analysis.AnalysisPartPositionProperties.AxisLocationEnum.TOP_RIGHT
The axis location is at the top right corner.

Tekla.Structures.Analysis.AnalysisPartPositionProperties.AxisLocationEnum.MIDDLE_LEFT
The axis location is at the middle left corner.

Tekla.Structures.Analysis.AnalysisPartPositionProperties.AxisLocationEnum.MIDDLE_CENTER
The axis location is at middle center.

Tekla.Structures.Analysis.AnalysisPartPositionProperties.AxisLocationEnum.MIDDLE_RIGHT
The axis location is at the middle right corner.

Tekla.Structures.Analysis.AnalysisPartPositionProperties.AxisLocationEnum.BOTTOM_LEFT
The axis location is at the bottom left corner.

Tekla.Structures.Analysis.AnalysisPartPositionProperties.AxisLocationEnum.BOTTOM_CENTER
The axis location is at bottom center.

Tekla.Structures.Analysis.AnalysisPartPositionProperties.AxisLocationEnum.BOTTOM_RIGHT
The axis location is at the bottom right corner.